tutorials/Ramp/unsteady/train/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0. 0 0.)
    (10. 0 0.)
    (10. 3 0.)
    (0. 3 0.)
    (0. 0 0.1)
    (10. 0 0.1)
    (10. 3 0.1)
    (0. 3 0.1)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (100 50 1) 
  simpleGrading 
  (
      1 10 1
  )
);

edges
(

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    sym
    {
        type symmetry;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    bot
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
